## 자료 준비 및 손질

### 소실 자료 다루기

In [6]:
import pandas as pd
import numpy as np

In [7]:
문 = pd.Series(['아보카도', '아리랑', np.nan, '아리아'])
문

0    아보카도
1     아리랑
2     NaN
3     아리아
dtype: object

In [8]:
문.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
# 파이썬 내장 객체인 None도 소실값으로 간주한다.
문[0] = None
문.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
시 = pd.Series([1.3, np.nan, 9, -20, np.nan])
시

0     1.3
1     NaN
2     9.0
3   -20.0
4     NaN
dtype: float64

In [11]:
시.dropna()

0     1.3
2     9.0
3   -20.0
dtype: float64

In [12]:
시[시.notnull()]

0     1.3
2     9.0
3   -20.0
dtype: float64

In [13]:
# dropna는 NA를 하나라도 포함한 행이 있으면 모두 제거한다.
데 = pd.DataFrame([[1., 3.5, 2.2], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.0]])
데

     0    1    2
0  1.0  3.5  2.2
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
데.dropna()

     0    1    2
0  1.0  3.5  2.2

In [15]:
데.dropna(how = 'all')

     0    1    2
0  1.0  3.5  2.2
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
데[3] = np.nan
데

     0    1    2   3
0  1.0  3.5  2.2 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
데.dropna(axis=1, how='all')

     0    1    2
0  1.0  3.5  2.2
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
데 = pd.DataFrame(np.random.randn(7, 3))
데.iloc[:4, 1] = np.nan
데.iloc[:2, 2] = np.nan
데

          0         1         2
0  0.361293       NaN       NaN
1  1.087380       NaN       NaN
2 -1.254255       NaN  0.742928
3 -2.388520       NaN -1.278068
4 -0.345717  0.744051  0.477304
5  0.843975 -1.423447  1.485115
6 -0.406264  0.612269 -0.983994

In [19]:
# `thresh=2`를 이용해서 NaN이 2이상인 행들을 모두 제거한다.
데.dropna(thresh=2)

          0         1         2
2 -1.254255       NaN  0.742928
3 -2.388520       NaN -1.278068
4 -0.345717  0.744051  0.477304
5  0.843975 -1.423447  1.485115
6 -0.406264  0.612269 -0.983994

### 소실값 채우기

In [20]:
데.fillna(0)

          0         1         2
0  0.361293  0.000000  0.000000
1  1.087380  0.000000  0.000000
2 -1.254255  0.000000  0.742928
3 -2.388520  0.000000 -1.278068
4 -0.345717  0.744051  0.477304
5  0.843975 -1.423447  1.485115
6 -0.406264  0.612269 -0.983994

In [21]:
데.fillna({1: 0, 2: 0.5})

          0         1         2
0  0.361293  0.000000  0.500000
1  1.087380  0.000000  0.500000
2 -1.254255  0.000000  0.742928
3 -2.388520  0.000000 -1.278068
4 -0.345717  0.744051  0.477304
5  0.843975 -1.423447  1.485115
6 -0.406264  0.612269 -0.983994

In [22]:
# inplace=True를 이용하면 자신의 값을 변경한다.
데.fillna({1: 0, 2: 0.5}, inplace=True)
데

          0         1         2
0  0.361293  0.000000  0.500000
1  1.087380  0.000000  0.500000
2 -1.254255  0.000000  0.742928
3 -2.388520  0.000000 -1.278068
4 -0.345717  0.744051  0.477304
5  0.843975 -1.423447  1.485115
6 -0.406264  0.612269 -0.983994

In [23]:
프 = pd.DataFrame(np.random.randn(6, 3))
프.iloc[2:, 1] = np.nan
프.iloc[4:, 2] = np.nan
프

          0         1         2
0 -0.490437  0.906751  3.087009
1  1.716943 -0.380958  0.220363
2 -0.054861       NaN  1.748225
3 -1.996671       NaN -0.627219
4  2.017452       NaN       NaN
5 -2.011405       NaN       NaN

In [24]:
프.fillna(method='ffill')

          0         1         2
0 -0.490437  0.906751  3.087009
1  1.716943 -0.380958  0.220363
2 -0.054861 -0.380958  1.748225
3 -1.996671 -0.380958 -0.627219
4  2.017452 -0.380958 -0.627219
5 -2.011405 -0.380958 -0.627219

In [25]:
# 앞 방향으로 결측값 채우는 회수를 제한하기
프.fillna(method='ffill', limit=2)

          0         1         2
0 -0.490437  0.906751  3.087009
1  1.716943 -0.380958  0.220363
2 -0.054861 -0.380958  1.748225
3 -1.996671 -0.380958 -0.627219
4  2.017452       NaN -0.627219
5 -2.011405       NaN -0.627219

In [26]:
시 = pd.Series([np.nan, -1.5, np.nan, 3, 2.54])
시

0     NaN
1   -1.50
2     NaN
3    3.00
4    2.54
dtype: float64

In [27]:
시.fillna(시.mean())

0    1.346667
1   -1.500000
2    1.346667
3    3.000000
4    2.540000
dtype: float64

In [28]:
시.fillna(시.median())

0    2.54
1   -1.50
2    2.54
3    3.00
4    2.54
dtype: float64

### 자료 변환

#### 중복 제거

In [29]:
데 = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                 'k2': [1, 1, 2, 3, 3, 4, 4]})
데

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
데.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
데.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
데['v1'] = range(7)
데

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [33]:
데.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [34]:
# 마지막 행을 유지하고 싶으면 keep='last'를 인자로 넘긴다.
데.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 함수 또는 대응을 이용한 자료 변환

In [35]:
데 = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                  'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
데

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [36]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [37]:
# 맵핑을 위해 소문자 변경
lowered_case = 데['food'].str.lower()
lowered_case

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [38]:
데['animal'] = lowered_case.map(meat_to_animal)
데

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [39]:
데['food'].map(lambda x : meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 값 대체하기

In [40]:
시 = pd.Series([1., -999, 2, -999, -1000, -3])
시

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5      -3.0
dtype: float64

In [41]:
# 소실값으로 대체
시.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5      -3.0
dtype: float64

In [42]:
시.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5   -3.0
dtype: float64

In [43]:
시.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5   -3.0
dtype: float64

In [44]:
시.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5   -3.0
dtype: float64

### 축 인덱스 이름 변경하기

In [45]:
데 = pd.DataFrame(np.arange(12).reshape(3, 4), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])
데

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [46]:
트 = lambda x: x[:4].upper()

데.index.map(트)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [47]:
데.index = 데.index.map(트)
데

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [48]:
# str.title - 첫 글자 대문자로 반환
데.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [49]:
# rename은 사전형 객체 인자를 받아서 지정된 이름만 변경할 수 있다.
데.rename(index = {'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [50]:
데.rename(index = {'OHIO':'INDIANA'}, inplace = True)
데

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### 구간으로 나누기

In [51]:
나이 = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [52]:
구간 = [18, 25, 35, 60, 100]
연령대 = pd.cut(나이, 구간) # 18초과 25미만, 25초과 35미만
연령대

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [53]:
연령대.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [54]:
연령대.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [55]:
연령대.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [56]:
# 구간의 오른쪽 끝 값이 포함되지 않게 하려면 right=False를 이용하면 된다.
pd.cut(나이, 구간, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [57]:
구간이름 = ['청년', '청장년', '중년', '노년']
pd.cut(나이, 구간, labels=구간이름)

['청년', '청년', '청년', '청장년', '청년', ..., '청장년', '노년', '중년', '중년', '청장년']
Length: 12
Categories (4, object): ['청년' < '청장년' < '중년' < '노년']

In [58]:
rng = np.random.RandomState(0)
data = rng.randn(20)

In [59]:
# 구간 대신에 정수를 입력하면 같은 크기의 구간으로 나눈다.
pd.cut(data, 4, precision=2) #precision=은 소수점 자릿수를 제한한다

[(1.44, 2.24], (-0.17, 0.63], (0.63, 1.44], (1.44, 2.24], (1.44, 2.24], ..., (-0.17, 0.63], (1.44, 2.24], (-0.98, -0.17], (-0.17, 0.63], (-0.98, -0.17]]
Length: 20
Categories (4, interval[float64]): [(-0.98, -0.17] < (-0.17, 0.63] < (0.63, 1.44] < (1.44, 2.24]]

In [60]:
# qcut으로 백분위수를 이용해서도 구간을 나눌 수 있다.
data = rng.randn(100)
cats = pd.qcut(data,4)
cats

[(-2.554, -0.743], (0.0489, 0.874], (0.0489, 0.874], (-0.743, 0.0489], (0.874, 2.27], ..., (0.0489, 0.874], (0.874, 2.27], (-0.743, 0.0489], (0.0489, 0.874], (0.874, 2.27]]
Length: 100
Categories (4, interval[float64]): [(-2.554, -0.743] < (-0.743, 0.0489] < (0.0489, 0.874] < (0.874, 2.27]]

In [61]:
pd.value_counts(cats)
# 대략 같은 갯수의 구간들로 나눈다.

(0.874, 2.27]       25
(0.0489, 0.874]     25
(-0.743, 0.0489]    25
(-2.554, -0.743]    25
dtype: int64

In [62]:
# 직접 백분위수 입력
d2 = pd.qcut(data, [0, 0.1, 0.3, 0.9, 1.])

In [63]:
pd.value_counts(d2)

(-0.531, 1.493]     60
(-1.278, -0.531]    20
(1.493, 2.27]       10
(-2.554, -1.278]    10
dtype: int64

### 이상치 찾아 걸러내기

In [64]:
data = pd.DataFrame(rng.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.072691    -0.009708    -0.035053    -0.012709
std       0.975811     0.967762     0.988561     0.998333
min      -3.740101    -3.046143    -3.116857    -3.392300
25%      -0.757354    -0.687835    -0.694916    -0.686776
50%      -0.032938    -0.030754    -0.031001    -0.041138
75%       0.601488     0.622309     0.621996     0.648778
max       2.929096     2.662727     3.801660     3.427539

In [65]:
data[(np.abs(data) > 3).any(1)] # 행 반환

            0         1         2         3
117 -0.392389 -3.046143  0.543312  0.439043
233 -0.156024  1.049093  3.170975  0.189500
474  0.708860  0.422819 -3.116857  0.644452
740 -0.387313 -0.347585  3.306574 -1.510200
749 -1.091033 -0.126856  3.801660  2.315171
831  0.236225 -0.752582  0.045113  3.427539
835 -0.087328 -0.553965 -3.006499 -0.047166
889 -0.953179 -0.479297 -1.345508 -3.392300
908 -3.740101  0.973577  1.175155 -1.124703

In [66]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.071951    -0.009662    -0.036208    -0.012744
std       0.973304     0.967618     0.983853     0.995695
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.757354    -0.687835    -0.694916    -0.686776
50%      -0.032938    -0.030754    -0.031001    -0.041138
75%       0.601488     0.622309     0.621996     0.648778
max       2.929096     2.662727     3.000000     3.000000

### 무작위 추출 및 순열

시리즈 또는 데이터프레임의 행을 무작위로 순서있게 나열하는 것을 numpy.random.permutation을 이용할 수 있다.   
축 크기에 해당되는 permutation 함수를 호출하면 무작위 순열이 반환된다.

In [67]:
df = pd.DataFrame(np.arange(5 * 4). reshape(5, 4))
sampler = rng.permutation(5)
sampler

array([3, 4, 2, 1, 0])

In [68]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [69]:
df.iloc[sampler]

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

In [70]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

In [71]:
df.sample(3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7

In [72]:
s1 = pd.Series([7, 3, -2, 1, 4])
s1.sample(n=10, replace=True)

3    1
3    1
0    7
1    3
0    7
1    3
2   -2
4    4
1    3
1    3
dtype: int64

### Computing Indicator/Dummy Variables

one-hot encoding

In [73]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'keys': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})
df

  keys  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    b      5

In [74]:
pd.get_dummies(df['keys'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [75]:
# get_dummies함수에prefix=` 인자를 이용해서 열이름 앞에 덧붙일 수 있다.
pd.get_dummies(df['keys'], prefix='key')

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [76]:
# cut과 get_dummies를 결합해서 사용하면 편리하다.
values = rng.rand(10)
values

array([0.45238332, 0.69528239, 0.86311251, 0.22121285, 0.49263344,
       0.97590819, 0.73727458, 0.39400696, 0.49754792, 0.91965143])

In [77]:
bins = [ 0., 0.2, 0.4, 0.6, 0.8, 1.]

pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           1           0           0
1           0           0           0           1           0
2           0           0           0           0           1
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           0           0           1
6           0           0           0           1           0
7           0           1           0           0           0
8           0           0           1           0           0
9           0           0           0           0           1

## 문자열 처리

### 문자열 객체 메소드

In [78]:
# 쉼표로 구분된 문자열은 split 메소드를 이용해서 간단히 리스트로 변환된다.
val = 'a,b,   guido'
val.split(',')

['a', 'b', '   guido']

In [79]:
# strip과 결합해서 공백 문자들을 없앨 수 있다.
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [80]:
"::".join(pieces)

'a::b::guido'

In [81]:
'guido' in val

True

In [82]:
val.index(',')

1

In [83]:
val.find(':')

-1

In [84]:
val.index(':')

ValueError: substring not found

In [86]:
val.find('.')

-1

In [87]:
val.replace(',','')

'ab   guido'

### 정규표현식

In [88]:
import re

text = "foo    bar\t baz  \tqux"

In [89]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [92]:
# 지정된 소스를 실행 준비된 코드 객체로 반환.
regex = re.compile('\s+')

regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [91]:
regex.findall(text)

['    ', '\t ', '  \t']

`match`는 텍스트의 첫문자로부터 유형을 찾고 `search`는 그렇지 않고 모든 부분에서 찾는다.

In [93]:
# text의 첫문자가 공백문자가 아니다.
re.match('\s+', text)

In [94]:
re.search('\s+', text)

`findall`은 유형에 맞는 모든 문자열을 리스트형으로 반환한다.

In [95]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [96]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [97]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [98]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [99]:
m = regex.search(text)
m

In [100]:
text[m.start():m.end()]

'dave@google.com'

In [102]:
# sub 메소드는 텍스트에서 유형과 일치하는 문자열을 대체 문자열로 바꾼 텍스트를 반환한다
regex.sub('이메일필요', text)

'Dave 이메일필요\nSteve 이메일필요\nRob 이메일필요\nRyan 이메일필요\n'

In [103]:
pattern_g = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [105]:
regex_g = re.compile(pattern_g, flags=re.IGNORECASE)

In [106]:
m_g = regex_g.search(text)

m_g.groups()

('dave', 'google', 'com')

In [109]:
m_g.group()

'dave@google.com'

In [110]:
m_g.group(1)

'dave'

In [111]:
regex_g.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

### 판다스 벡터 문자열 함수

In [112]:
data = pd.Series({'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan})

data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [114]:
data.map(lambda x: x.count('g'))
#np.nan이 float 형이기 때문에 문자열 함수인 count를 적용할 수 없어 오류를 발생한다.

AttributeError: 'float' object has no attribute 'count'

In [115]:
data[:-1].map(lambda x: x.count('g'))

Dave     2
Steve    1
Rob      1
dtype: int64

In [116]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [117]:
pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [118]:
data.str.extractall(pattern, flags=re.IGNORECASE)
# 데이터프레임 반환

                 0       1    2
      match
Dave  0       dave  google  com
Steve 0      steve   gmail  com
Rob   0        rob   gmail  com

In [120]:
ser = data.copy()
ser[0] = ser[0] + ', dooly@gmail.com'
ser

Dave     dave@google.com, dooly@gmail.com
Steve                     steve@gmail.com
Rob                         rob@gmail.com
Wes                                   NaN
dtype: object

In [122]:
#match 하위 인덱스의 성분이 하나 늘어난 것을 알 수 있다.
ser.str.extractall(pattern, flags=re.IGNORECASE)

                 0       1    2
      match
Dave  0       dave  google  com
      1      dooly   gmail  com
Steve 0      steve   gmail  com
Rob   0        rob   gmail  com

In [123]:
ser.str.get(0)

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [124]:
ser.str[:-1]

Dave     dave@google.com, dooly@gmail.co
Steve                     steve@gmail.co
Rob                         rob@gmail.co
Wes                                  NaN
dtype: object